import React from "react";
import Content from "../components/Content";

export default function Home() {
  const title1 = "איך נולדים צבעים בזוהר הצפוני?";
  const text1 =
    " הזוהר הצפוני, או האורות הצפוניים, הם תופעה אטמוספירית מרהיבה הנגרמת על ידי אינטראקציה בין חלקיקים טעונים מהשמש לבין השדה המגנטי של כדור הארץ. כאשר חלקיקים אלו פוגעים באטמוספירה של כדור הארץ, הם מעוררים אטומים ומולקולות, מה שגורם להם לפלוט אור בצבעים שונים. הצבעים הנפוצים ביותר בזוהר הצפוני הם ירוק, אדום, כחול וסגול, כאשר הירוק הוא הנפוץ ביותר. צבעים אלו נוצרים על ידי סוגים שונים של אטומים ומולקולות באטמוספירה, כמו חמצן וחנקן, שמגיבים עם החלקיקים הטעונים. התופעה מתרחשת בעיקר באזורים הקרובים לקוטב הצפוני, כמו נורווגיה, שבדיה, פינלנד וקנדה, אך לעיתים רחוקות ניתן לראותה גם באזורים נמוכים יותר. הזוהר הצפוני הוא לא רק תופעה טבעית מרהיבה, אלא גם נושא למחקר מדעי חשוב, שכן הוא מספק תובנות על האינטראקציה בין השמש לכדור הארץ ועל השדה המגנטי של כדור הארץ. מעבר לכך, הזוהר הצפוני מהווה מוקד משיכה לתיירים ומטיילים מכל העולם, שמגיעים במיוחד כדי לחזות ביופיו המרהיב של הטבע.";
  const title2 = " סודו של ממתק השוקולד הראשון בעולם";
  const text2 =
    "היסטוריונים מאמינים שמקור השוקולד הוא אצל בני המאיה והאצטקים, עוד לפני אלפי שנים. הם לא אכלו שוקולד כמו שאנחנו מכירים אותו היום, אלא שתו משקה מריר שהוכן מגרגרי קקאו טחונים עם תבלינים חריפים. האירופאים שהגיעו לעולם החדש במאה ה־16 הביאו את הקקאו ליבשת שלהם, הוסיפו סוכר וחלב – וכך נולד השוקולד המתוק שאנחנו מכירים ואוהבים כיום. מעניין לחשוב שממתק כל כך נפוץ התחיל בכלל כמשקה פולחני חריף!";
  return (
    <>
      <Content text={text1} title={title1} />
      <Content text={text2} title={title2} />
    </>
  );
}
