import React from "react";

export default function Content() {
  return (
    <main className="content">
      <h2>איך נולדים צבעים בזוהר הצפוני?</h2>
      <p>
        איך נולדים צבעים בזוהר הצפוני הזוהר הצפוני (Aurora Borealis) נוצר כאשר
        חלקיקים טעונים מהשמש פוגעים בשכבות הגבוהות של האטמוספרה של כדור הארץ.
        ההתנגשות הזאת מעבירה אנרגיה לאטומים באוויר, וכאשר האטומים חוזרים למצב
        הרגוע שלהם – הם פולטים אור בצבעים שונים. חמצן יוצר אור ירקרק-צהוב, בעוד
        שחנקן נותן צבעים אדמדמים וכחלחלים. השילוב של כל אלו יוצר את אחד המופעים
        היפים ביותר בטבע.
      </p>
    </main>
  );
}
