import React from "react";
import Header from "./components/Header.jsx";
import Sidebar from "./components/Sidebar.jsx";
import Content from "./components/Content.jsx";
import Footer from "./components/Footer.jsx";

export default function App() {
  const text = `הזוהר הצפוני, או האורות הצפוניים, הם תופעה אטמוספירית מרהיבה הנגרמת על ידי אינטראקציה בין חלקיקים טעונים מהשמש לבין השדה המגנטי של כדור הארץ. כאשר חלקיקים אלו פוגעים באטמוספירה של כדור הארץ, הם מעוררים אטומים ומולקולות, מה שגורם להם לפלוט אור בצבעים שונים. הצבעים הנפוצים ביותר בזוהר הצפוני הם ירוק, אדום, כחול וסגול, כאשר הירוק הוא הנפוץ ביותר. צבעים אלו נוצרים על ידי סוגים שונים של אטומים ומולקולות באטמוספירה, כמו חמצן וחנקן, שמגיבים עם החלקיקים הטעונים. התופעה מתרחשת בעיקר באזורים הקרובים לקוטב הצפוני, כמו נורווגיה, שבדיה, פינלנד וקנדה, אך לעיתים רחוקות ניתן לראותה גם באזורים נמוכים יותר. הזוהר הצפוני הוא לא רק תופעה טבעית מרהיבה, אלא גם נושא למחקר מדעי חשוב, שכן הוא מספק תובנות על האינטראקציה בין השמש לכדור הארץ ועל השדה המגנטי של כדור הארץ. מעבר לכך, הזוהר הצפוני מהווה מוקד משיכה לתיירים ומטיילים מכל העולם, שמגיעים במיוחד כדי לחזות ביופיו המרהיב של הטבע.`;
  return (
    <div className="page">
      <Header />

      <div className="main">
        <Sidebar />
        <Content text={text} />
      </div>

      <Footer />
    </div>
  );
}
